jmeter/tests-plans/wms_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>

    <!-- ===================== -->
    <!-- Test Plan -->
    <!-- ===================== -->
    <TestPlan guiclass="TestPlanGui"
              testclass="TestPlan"
              testname="GeoServer WMS GetMap Load Test"
              enabled="true">
      <stringProp name="TestPlan.comments">WMS GetMap test with random BBOX (env-driven)</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>

    <hashTree>

      <!-- ===================== -->
      <!-- Thread Group -->
      <!-- ===================== -->
      <ThreadGroup guiclass="ThreadGroupGui"
                   testclass="ThreadGroup"
                   testname="Users"
                   enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__P(USERS,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(RAMPUP,30)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(DURATION,120)}</stringProp>
      </ThreadGroup>

      <hashTree>

        <!-- ===================== -->
        <!-- HTTP Request Defaults -->
        <!-- ===================== -->
        <ConfigTestElement guiclass="HttpDefaultsGui"
                           testclass="ConfigTestElement"
                           testname="HTTP Request Defaults"
                           enabled="true">
          <stringProp name="HTTPSampler.protocol">${__env(PROTOCOL)}</stringProp>
          <stringProp name="HTTPSampler.domain">${__env(HOST)}</stringProp>
          <stringProp name="HTTPSampler.port">${__env(PORT)}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        </ConfigTestElement>

        <hashTree/>

        <!-- ===================== -->
        <!-- HTTP Header Manager -->
        <!-- ===================== -->
        <HeaderManager guiclass="HeaderPanel"
                       testclass="HeaderManager"
                       testname="HTTP Headers"
                       enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">image/png</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>

        <hashTree/>

        <!-- ===================== -->
        <!-- JSR223 PreProcessor -->
        <!-- ===================== -->
        <JSR223PreProcessor guiclass="TestBeanGUI"
                            testclass="JSR223PreProcessor"
                            testname="Randomize BBOX"
                            enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
            <![CDATA[
            def minx = System.getenv("WMS_BBOX_MINX").toDouble()
            def miny = System.getenv("WMS_BBOX_MINY").toDouble()
            def maxx = System.getenv("WMS_BBOX_MAXX").toDouble()
            def maxy = System.getenv("WMS_BBOX_MAXY").toDouble()
            def offset = System.getenv("WMS_BBOX_OFFSET").toDouble()

            def dx = (Math.random() * offset) - (offset / 2)
            def dy = (Math.random() * offset) - (offset / 2)

            def x1 = minx + dx
            def y1 = miny + dy
            def x2 = maxx + dx
            def y2 = maxy + dy

            vars.put("WMS_BBOX", "${x1},${y1},${x2},${y2}")
            ]]>
          </stringProp>
        </JSR223PreProcessor>

        <hashTree/>

        <!-- ===================== -->
        <!-- WMS GetMap Sampler -->
        <!-- ===================== -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="WMS GetMap"
                          enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">

              <elementProp name="service" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">service</stringProp>
                <stringProp name="Argument.value">WMS</stringProp>
              </elementProp>

              <elementProp name="version" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">version</stringProp>
                <stringProp name="Argument.value">${__env(WMS_VERSION)}</stringProp>
              </elementProp>

              <elementProp name="request" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">request</stringProp>
                <stringProp name="Argument.value">GetMap</stringProp>
              </elementProp>

              <elementProp name="layers" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.name">layers</stringProp>
                <stringProp name="Argument.value">${__env(WMS_LAYER)}</stringProp>
              </elementProp>

              <elementProp name="bbox" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">bbox</stringProp>
                <stringProp name="Argument.value">${WMS_BBOX}</stringProp>
              </elementProp>

              <elementProp name="width" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">width</stringProp>
                <stringProp name="Argument.value">${__env(WMS_WIDTH)}</stringProp>
              </elementProp>

              <elementProp name="height" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.name">height</stringProp>
                <stringProp name="Argument.value">${__env(WMS_HEIGHT)}</stringProp>
              </elementProp>

              <elementProp name="srs" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.name">srs</stringProp>
                <stringProp name="Argument.value">${__env(WMS_SRS)}</stringProp>
              </elementProp>

              <elementProp name="format" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.name">format</stringProp>
                <stringProp name="Argument.value">${__env(WMS_FORMAT)}</stringProp>
              </elementProp>

            </collectionProp>
          </elementProp>

          <stringProp name="HTTPSampler.method">GET</stringProp>
          <stringProp name="HTTPSampler.path">${__env(WMS_PATH)}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>

        <hashTree>

          <!-- ===================== -->
          <!-- Assertions -->
          <!-- ===================== -->
          <ResponseAssertion guiclass="AssertionGui"
                             testclass="ResponseAssertion"
                             testname="HTTP 200"
                             enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="200">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>

          <hashTree/>

          <ResponseAssertion guiclass="AssertionGui"
                             testclass="ResponseAssertion"
                             testname="Content-Type image/png"
                             enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="image/png">image/png</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_headers</stringProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>

          <hashTree/>

        </hashTree>

      </hashTree>

    </hashTree>

  </hashTree>
</jmeterTestPlan>